#+TITLE: fdroid_downloader

Downloads latest APKs for the given apps.

* Install

Install directly from GitHub with uv and expose the CLI:

#+BEGIN_SRC shell
uv tool install 'git+https://github.com/NightMachinery/fdroid_downloader.git'
#+END_SRC

* Usage
#+begin_src bsh.dash :results verbatim :exports both :wrap example
fdroid-downloader --help
#+end_src

#+RESULTS:
#+begin_example
usage: fdroid-downloader [-h] [-d DIR] [--search | --no-search]
                         packages [packages ...]

Download APKs from F-Droid.

positional arguments:
  packages              Package names or search queries to download.

options:
  -h, --help            show this help message and exit
  -d DIR, --dir DIR     Output directory (default: .)
  --search, --no-search
                        Enable fuzzy searching in F-Droid.
#+end_example

#+begin_src zsh :eval never
fdroid-downloader -d ~/Downloads/ se.lublin.mumla chat.delta.lite
#+end_src
